app/Controllers/CustomerAccounts.php

    public function index()
    {
        $customerModel = new CustomerModel();

        $data['customers'] = $customerModel->findAll();
---
SELECT *
FROM `customers`